{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.12.0",
          "author": null,
          "description": "New: When one of the sources download fails, fall back to cache and continue rest of the build.\nChore: Dependency updates\nAdded docs for Netlify deployment\nFixed #71 #69 #65\nThank you: @sokomin, @molakirlee, @philippnagel, @tianheg",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.12.0",
          "publishedOn": "2022-01-10T05:25:18.000Z",
          "wordCount": 308,
          "title": "v1.12.0"
        }
      ]
    },
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=360490",
          "author": "Chris Coyier",
          "description": "Say you have an elements with CSS tooltips and you’re going to position those tooltips such that it opens up next to the element on hover (or probably better: when clicked/tapped). Next to it where? Above it? What if the …\nWhat Would it Take to Prevent CSS Tooltips From Overflowing? originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/can-css-prevent-tooltips-from-overflowing/",
          "publishedOn": "2022-01-11T23:18:56.000Z",
          "wordCount": 884,
          "title": "What Would it Take to Prevent CSS Tooltips From Overflowing?"
        },
        {
          "id": "https://css-tricks.com/?p=359243",
          "author": "Adam Rackis",
          "description": "Vite (pronounced “veet”) is a newish JavaScript bundler. It comes batteries-included, requires almost no configuration to be useful, and includes plenty of configuration options. Oh—and it’s fast. Incredibly fast.\nThis post will walk through the process of converting an existing …\nAdding Vite to Your Existing Web App originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/adding-vite-to-your-existing-web-app/",
          "publishedOn": "2022-01-11T15:38:06.000Z",
          "wordCount": 2831,
          "title": "Adding Vite to Your Existing Web App"
        },
        {
          "id": "https://css-tricks.com/?p=360061",
          "author": "Chris Coyier",
          "description": "Custom Fields in WordPress are arbitrary bits of data that you can apply to Posts, Pages, and Custom Post Types in WordPress. Metadata, as it were, in the form of key/value pairs. For example:\nKey: subtitle / Value: They are \n…\nHow to Use Native Custom Fields in WordPress (and 5 Useful Examples) originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/use-custom-fields-in-wordpress/",
          "publishedOn": "2022-01-11T00:41:48.000Z",
          "wordCount": 2313,
          "title": "How to Use Native Custom Fields in WordPress (and 5 Useful Examples)"
        },
        {
          "id": "https://css-tricks.com/?p=360873",
          "author": "Chris Coyier",
          "description": "Raw Chromium, perhaps?\nSo, Chrome is based on Chromium which is open-source. Chrome is Chromium with Google’s extra stuff on top of it. What extra stuff? Kinda lots! A few years ago, The Verge published “Microsoft reveals all the …\nWhat is Chromium Without Chrome on Top? originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/what-is-chromium-without-chrome-on-top/",
          "publishedOn": "2022-01-10T22:02:49.000Z",
          "wordCount": 821,
          "title": "What is Chromium Without Chrome on Top?"
        },
        {
          "id": "https://css-tricks.com/?p=359886",
          "author": "Mads Stoumann",
          "description": "If you’re disciplined and make use of the inheritance that the CSS cascade provides, you’ll end up writing less CSS. But because our styles often comes from all kinds of sources — and can be a pain to structure and …\nDon’t Fight the Cascade, Control It! originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/dont-fight-the-cascade-control-it/",
          "publishedOn": "2022-01-10T15:22:08.000Z",
          "wordCount": 2894,
          "title": "Don’t Fight the Cascade, Control It!"
        },
        {
          "id": "https://css-tricks.com/?p=360711",
          "author": "Chris Coyier",
          "description": "Every now and then, I find that I’ve accumulated a bunch of links about various things I find interesting. Typography is one of those things! Here’s a list of typography links to other articles that I’ve been saving up and …\n8 Interesting Typography Links for January 2022 originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/typography-links-january-2022/",
          "publishedOn": "2022-01-07T22:31:52.000Z",
          "wordCount": 847,
          "title": "8 Interesting Typography Links for January 2022"
        },
        {
          "id": "https://css-tricks.com/?p=360113",
          "author": "Geoff Graham",
          "description": "I was killing some time browsing my CodePen feed for some eye candy and didn’t need to go past the first page before spotting a neat CSS hover effect by Adam Argyle.\nI must’ve spent 10 minutes just staring …\nAdam Argyle’s Sick Mouse-Out CSS Hover Effect originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/adam-argyles-sick-mouse-out-css-hover-effect/",
          "publishedOn": "2022-01-07T20:15:19.000Z",
          "wordCount": 1120,
          "title": "Adam Argyle’s Sick Mouse-Out CSS Hover Effect"
        },
        {
          "id": "https://css-tricks.com/?p=359823",
          "author": "Rafał Pastuszak",
          "description": "I took a break from work and started some small, personal projects (toys). One of those small projects is potato.horse where I keep all of my doodles, visual short stories and jokes. Check it out!\nHowever, this post is not …\nuseRainbow() originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/userainbow/",
          "publishedOn": "2022-01-07T14:59:04.000Z",
          "wordCount": 1819,
          "title": "useRainbow()"
        },
        {
          "id": "https://css-tricks.com/?p=360320",
          "author": "Chris Coyier",
          "description": "There is an easy-to-use CSS container query polyfill now. You essentially conditionally load it and forget about it. Then write spec-compliant container queries code.\nA New Container Query Polyfill That Just Works originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/a-new-container-query-polyfill-that-just-works/",
          "publishedOn": "2022-01-06T22:28:46.000Z",
          "wordCount": 1173,
          "title": "A New Container Query Polyfill That Just Works"
        },
        {
          "id": "https://css-tricks.com/?p=358917",
          "author": "Alex Lazar",
          "description": "I was working on a client project a few days ago and wanted to create a certain effect on an <img>. See, background images can do the effect I was looking for somewhat easily with background-attachment: fixed;. With …\nThe Search For a Fixed Background Effect With Inline Images originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/fixed-background-effect/",
          "publishedOn": "2022-01-06T15:58:55.000Z",
          "wordCount": 1981,
          "title": "The Search For a Fixed Background Effect With Inline Images"
        },
        {
          "id": "https://css-tricks.com/?p=358917",
          "author": "Alex Lazar",
          "description": "I was working on a client project a few days ago and wanted to create a certain effect on an <img>. See, background images can do the effect I was looking for somewhat easily with background-attachment: fixed;. With …\nThe Search For a Fixed Background Effect With Inline Images originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/the-search-for-a-fixed-background-effect-with-inline-images/",
          "publishedOn": "2022-01-06T15:58:55.000Z",
          "wordCount": 1196,
          "title": "The Search For a Fixed Background Effect With Inline Images"
        },
        {
          "id": "https://css-tricks.com/?p=359736",
          "author": "Chris Coyier",
          "description": "We recently talked with Elad Shechter on his new CSS reset, and shortly after that Josh Comeau blogged his. \nWe’re in something of a new era of CSS resets where… you kind of don’t need one? There isn’t …\nNotes on Josh Comeau’s Custom CSS Reset originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/notes-on-josh-comeaus-custom-css-reset/",
          "publishedOn": "2022-01-05T21:22:45.000Z",
          "wordCount": 1291,
          "title": "Notes on Josh Comeau’s Custom CSS Reset"
        },
        {
          "id": "https://css-tricks.com/?p=360239",
          "author": "Rob Levin",
          "description": "Your mission — should you decide to accept it — is to build a Button component in four frameworks, but, only use one button.css file!\nThis idea is very important to me. I’ve been working on a component library called …\nHow to Make a Component That Supports Multiple Frameworks in a Monorepo originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/make-a-component-multiple-frameworks-in-a-monorepo/",
          "publishedOn": "2022-01-05T15:42:59.000Z",
          "wordCount": 5455,
          "title": "How to Make a Component That Supports Multiple Frameworks in a Monorepo"
        },
        {
          "id": "https://css-tricks.com/?p=359880",
          "author": "Chris Coyier",
          "description": "CSS overrides can change the default look of almost anything:\nYou can use CSS to override what a checkbox or radio button looks like, but if you don’t, the checkbox will look like a default checkbox on your operating system \n…\nShould CSS Override Default Browser Styles? originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/should-css-override-default-styles/",
          "publishedOn": "2022-01-04T19:50:18.000Z",
          "wordCount": 754,
          "title": "Should CSS Override Default Browser Styles?"
        },
        {
          "id": "https://css-tricks.com/?p=359838",
          "author": "Šime Vidas",
          "description": "I’ve encountered two bugs in Chrome while testing the new CSS text-decoration-thickness and text-underline-offset properties, and I want to share them with you here in this article.\nBut first, let’s acknowledge one thing:\nDefault underlines are inconsistent\nLet’s add a …\nCSS Underlines Are Too Thin and Too Low in Chrome originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/css-underlines-are-too-thin-and-too-low-in-chrome/",
          "publishedOn": "2022-01-04T15:30:18.000Z",
          "wordCount": 1120,
          "title": "CSS Underlines Are Too Thin and Too Low in Chrome"
        },
        {
          "id": "https://css-tricks.com/?p=360452",
          "author": "Chris Coyier",
          "description": "(This is a sponsored post.)\nWe use and love Jetpack around here. It’s a WordPress plugin that brings a whole suite of functionality to your site ranging from security to marketing with lots of ridiculously useful stuff in between! …\nJetpack Features We Love and Use at CSS-Tricks originally published on CSS-Tricks. You should get the newsletter and become a supporter.",
          "link": "https://css-tricks.com/jetpack-features-we-love-and-use-at-css-tricks/",
          "publishedOn": "2022-01-04T15:28:03.000Z",
          "wordCount": 937,
          "title": "Jetpack Features We Love and Use at CSS-Tricks"
        },
        {
          "id": "https://css-tricks.com/?p=360385",
          "author": "Chris Coyier",
          "description": "Fingerprinting is bad. It’s a term that refers to building up enough metadata about a user that you can essentially figure out who they are. JavaScript has access to all sorts of fingerprinting possibilities, which then combined with the IP …\nCSS-Based Fingerprinting originally published on CSS-Tricks",
          "link": "https://css-tricks.com/css-based-fingerprinting/",
          "publishedOn": "2022-01-03T21:45:10.000Z",
          "wordCount": 819,
          "title": "CSS-Based Fingerprinting"
        },
        {
          "id": "https://css-tricks.com/?p=359615",
          "author": "Lars Kölker",
          "description": "I’ll bet you are using browser extensions right now. Some of them are extremely popular and useful, like ad blockers, password managers, and PDF viewers. These extensions (or “add-ons”) are not limited to those purposes — you can do a …\nHow to Create a Browser Extension originally published on CSS-Tricks",
          "link": "https://css-tricks.com/how-to-create-a-browser-extension/",
          "publishedOn": "2022-01-03T15:12:31.000Z",
          "wordCount": 4633,
          "title": "How to Create a Browser Extension"
        },
        {
          "id": "https://css-tricks.com/?p=359698",
          "author": "Chris Coyier",
          "description": "The year has come to a close and it’s time again for our end-of-year wrapup. The most important message is this: thank you. (thankyouthankyou)\nThanks for stopping by and reading this site. If you didn’t, I’d be out …\nThank You (2021 Edition) originally published on CSS-Tricks",
          "link": "https://css-tricks.com/thank-you-2021-edition/",
          "publishedOn": "2022-01-01T17:50:59.000Z",
          "wordCount": 2856,
          "title": "Thank You (2021 Edition)"
        },
        {
          "id": "https://css-tricks.com/?p=360073",
          "author": "Chris Coyier",
          "description": "Ahmad Shadeed nails it again with “Defensive CSS.” The idea is that you should write CSS to be ready for issues caused by dynamic content. \nMore items than you thought would be there? No problem, the area can expand or …\nDefensive CSS originally published on CSS-Tricks",
          "link": "https://css-tricks.com/defensive-css/",
          "publishedOn": "2021-12-31T18:41:47.000Z",
          "wordCount": 447,
          "title": "Defensive CSS"
        },
        {
          "id": "https://css-tricks.com/?p=359941",
          "author": "Chris Coyier",
          "description": "I’m actually working on a talk (whew! been a while! kinda feels good!) about just how good the world of building websites has gotten. I plan to cover a wide swath of web tech, on purpose, because I …\nThe Web is More Gooder, and Other Observations on Today’s Web Tech originally published on CSS-Tricks",
          "link": "https://css-tricks.com/the-web-is-more-gooder-and-other-observations-on-todays-web-tech/",
          "publishedOn": "2021-12-30T20:08:07.000Z",
          "wordCount": 695,
          "title": "The Web is More Gooder, and Other Observations on Today’s Web Tech"
        },
        {
          "id": "https://css-tricks.com/?p=359729",
          "author": "Cassidy Williams",
          "description": "When you’re about to start a new website, what do you think first? Do you start with a library or framework you know, like React or Vue, or a meta-framework on top of that, like Next or Nuxt? Do you …\nAdd Less originally published on CSS-Tricks",
          "link": "https://css-tricks.com/add-less/",
          "publishedOn": "2021-12-30T16:23:29.000Z",
          "wordCount": 713,
          "title": "Add Less"
        },
        {
          "id": "https://css-tricks.com/?p=359708",
          "author": "ImageKit",
          "description": "(This is a sponsored post.)\nHigh-velocity, online businesses produce multiple digital assets like banners, images, videos, PDFs, etc., to promote their businesses online. For such businesses, Digital Asset Management (DAM) solutions are essential. These solutions help centrally store, manage, …\nNew Age DAM APIs to Simplify Your Media Workflows originally published on CSS-Tricks",
          "link": "https://css-tricks.com/new-age-dam-apis-to-simplify-your-media-workflows/",
          "publishedOn": "2021-12-30T16:18:38.000Z",
          "wordCount": 1790,
          "title": "New Age DAM APIs to Simplify Your Media Workflows"
        },
        {
          "id": "https://css-tricks.com/?p=358975",
          "author": "Cassie Evans",
          "description": "Animation on the web is often a contentious topic. I think, in part, it’s because bad animation is blindingly obvious, whereas well-executed animation fades seamlessly into the background. When handled well, animation can really elevate a website, whether it’s just …",
          "link": "https://css-tricks.com/empathetic-animation/",
          "publishedOn": "2021-12-29T16:04:16.000Z",
          "wordCount": 1119,
          "title": "Empathetic Animation"
        },
        {
          "id": "https://css-tricks.com/?p=359938",
          "author": "Chris Coyier",
          "description": "Lea Verou made a Web Component for processing Markdown. Looks like there were a couple of others out there already, but I agree with Lea in that this is a good use case for the light DOM (as opposed …",
          "link": "https://css-tricks.com/on-yak-shaving-and-md-block-a-new-html-element-for-markdown/",
          "publishedOn": "2021-12-29T16:03:44.000Z",
          "wordCount": 508,
          "title": "On Yak Shaving and md-block, a new HTML element for Markdown"
        },
        {
          "id": "https://css-tricks.com/?p=359055",
          "author": "Chris Ferdinandi",
          "description": "One of the best things you can do for your website in 2022 is add a service worker, if you don’t have one in place already. Service workers give your website super powers. Today, I want to show you some …",
          "link": "https://css-tricks.com/add-a-service-worker-to-your-site/",
          "publishedOn": "2021-12-28T16:14:23.000Z",
          "wordCount": 2487,
          "title": "Add a Service Worker to Your Site"
        },
        {
          "id": "https://css-tricks.com/?p=359860",
          "author": "Chris Coyier",
          "description": "I hadn’t heard of most of the Chrome extensions that Sarem Gizaw lists as 2021 favorites. Here are my hot takes on all of them, except the virtual learning specific ones that aren’t very relevant to me.\nLoomOh that’s \n…",
          "link": "https://css-tricks.com/our-favorite-chrome-extensions-of-2021/",
          "publishedOn": "2021-12-28T16:11:35.000Z",
          "wordCount": 949,
          "title": "Our favorite Chrome extensions of 2021"
        },
        {
          "id": "https://css-tricks.com/?p=359044",
          "author": "Jeremy Wagner",
          "description": "One of the coolest things I’ve been messing with in the last couple years is the CSS Paint API. I love it. I did a talk on it, and made a little gallery of my own paint worklets…",
          "link": "https://css-tricks.com/honor-prefers-color-scheme-in-the-css-paint-api-with-custom-properties/",
          "publishedOn": "2021-12-27T14:39:00.000Z",
          "wordCount": 1681,
          "title": "Honor prefers-color-scheme in the CSS Paint API with Custom Properties"
        },
        {
          "id": "https://css-tricks.com/?p=358956",
          "author": "Shawn Wang",
          "description": "The first time I had my breath taken away by a humble scrollbar was on this very site. When CSS-Tricks v17 rolled out with its FAT CHONKY BOI, my jaw dropped.\nI didn’t know you could do that on …",
          "link": "https://css-tricks.com/strut-your-stuff-with-a-custom-scrollbar/",
          "publishedOn": "2021-12-24T22:58:49.000Z",
          "wordCount": 772,
          "title": "Strut Your Stuff With a Custom Scrollbar"
        },
        {
          "id": "https://css-tricks.com/?p=358565",
          "author": "Robin Rendle",
          "description": "How do you make a great website? Everyone has an answer at the ready: Flashy animations! The latest punk-rock CSS trick! Gradients! Illustrations! Colors to pack a punch! Vite! And, sure, all these things might make a website better. But …",
          "link": "https://css-tricks.com/care-for-the-text/",
          "publishedOn": "2021-12-24T12:33:11.000Z",
          "wordCount": 827,
          "title": "Care for the Text"
        },
        {
          "id": "https://css-tricks.com/?p=358936",
          "author": "Emma Bostian",
          "description": "One thing people can do to make their websites better is to remember that you are not representative of all your users. Our life experiences and how we interact with the web are not indicative of how everyone interacts with …",
          "link": "https://css-tricks.com/remember-you-are-not-the-user/",
          "publishedOn": "2021-12-23T19:31:04.000Z",
          "wordCount": 499,
          "title": "Remember You Are Not the User"
        },
        {
          "id": "https://css-tricks.com/?p=359205",
          "author": "Geoff Graham",
          "description": "Last year, we kicked out a roundup of published surveys, research, and other findings from around the web. There were some nice nuggets in there, like a general sentiment that the web needs more documentation, Tailwind CSS dun …",
          "link": "https://css-tricks.com/2021-roundup-of-web-research/",
          "publishedOn": "2021-12-23T18:34:04.000Z",
          "wordCount": 4685,
          "title": "2021 Roundup of Web Research"
        },
        {
          "id": "https://css-tricks.com/?p=357692",
          "author": "Mel Choyce",
          "description": "How much time do you spend designing the content presentation for your websites? When you write a new blog post or create a new page, are you thinking about just the words, or how your readers will engage with those …",
          "link": "https://css-tricks.com/show-dont-tell/",
          "publishedOn": "2021-12-23T13:29:14.000Z",
          "wordCount": 1717,
          "title": "Show, Don’t Tell"
        },
        {
          "id": "https://css-tricks.com/?p=359033",
          "author": "Una Kravets",
          "description": "Ensuring accessibility is a clear path to making your website better. When you make your site accessible, you grow your audience, improve the experience for all people using it (not just those with accessibility needs), and you get SEO benefits…",
          "link": "https://css-tricks.com/personalize-it/",
          "publishedOn": "2021-12-23T00:10:06.000Z",
          "wordCount": 818,
          "title": "Personalize it!"
        },
        {
          "id": "https://css-tricks.com/?p=359675",
          "author": "Chris Coyier",
          "description": "There was a time when I’d write React, Angular, and Ember as a kind of generic grouping of three major JavaScript frameworks. And maybe just because three is a nice number, that became React, Vue, and Angular over time, thanks …",
          "link": "https://css-tricks.com/why-ember/",
          "publishedOn": "2021-12-22T16:10:40.000Z",
          "wordCount": 615,
          "title": "Why Ember?"
        },
        {
          "id": "https://css-tricks.com/?p=358761",
          "author": "Melanie Sumner",
          "description": "NGL, I was a little overwhelmed when I sat down to write this article. There are so many things that immediately flooded my mind—take out any extra divs; use links for URLs, use buttons for events and actions; use …",
          "link": "https://css-tricks.com/increase-your-reach/",
          "publishedOn": "2021-12-22T16:07:56.000Z",
          "wordCount": 1550,
          "title": "Increase Your Reach"
        },
        {
          "id": "https://css-tricks.com/?p=359146",
          "author": "Chris Coyier",
          "description": "Does shadow DOM improve style performance? — Nolan Lawson covers how, because of the inherent encapsulation of the shadow DOM, the styling gets applied a bit faster than it would if those styling rules were relevant to the entire page. But \n…",
          "link": "https://css-tricks.com/links-on-performance-v/",
          "publishedOn": "2021-12-21T18:42:43.000Z",
          "wordCount": 911,
          "title": "Links on Performance V"
        },
        {
          "id": "https://css-tricks.com/?p=358690",
          "author": "Eli Fitch",
          "description": "Everything kind of sucks right now. Things—generally—feel bad. Setting aside the broader realities of a global pandemic and rampant social injustices, we’re watching the identity of the web platform, an intrinsically free and open medium of creative expression, co-opted for …",
          "link": "https://css-tricks.com/make-joyful-things/",
          "publishedOn": "2021-12-21T15:32:58.000Z",
          "wordCount": 1197,
          "title": "Make Joyful Things"
        },
        {
          "id": "https://css-tricks.com/?p=359017",
          "author": "Chris Coyier",
          "description": "There are a number of ways to approach a dark mode for your website, but essentially you get all the styles ready for it and then apply them when the user has indicated they want them, whether by direct …",
          "link": "https://css-tricks.com/auto-dark-theme/",
          "publishedOn": "2021-12-20T18:34:47.000Z",
          "wordCount": 877,
          "title": "Auto Dark Theme"
        },
        {
          "id": "https://css-tricks.com/?p=359201",
          "author": "Chris Coyier",
          "description": "(This is a sponsored post.)\nWe’re going to go over details on how designer ↔️ developer collaboration in AWS Amplify Studio can make app building easier, but let’s cover one of those things right at the top here. \nSay …",
          "link": "https://css-tricks.com/build-great-apps-designer-and-developer-collaboration-just-got-easier/",
          "publishedOn": "2021-12-20T18:34:27.000Z",
          "wordCount": 1723,
          "title": "Build Great Apps: Designer and Developer Collaboration Just Got Easier"
        },
        {
          "id": "https://css-tricks.com/?p=358037",
          "author": "Heather Migliorisi",
          "description": "When I was working at my first “real” job in the field in the mid-2000s, it was hammered in the web dev field to build tiny websites (no more than 100KB per page), only use JavaScript for special effects, and …",
          "link": "https://css-tricks.com/be-prepared-for-failure-and-handle-it-gracefully/",
          "publishedOn": "2021-12-20T15:22:04.000Z",
          "wordCount": 1478,
          "title": "Be Prepared for Failure and Handle it Gracefully"
        },
        {
          "id": "https://css-tricks.com/?p=359489",
          "author": "Chris Coyier",
          "description": "Just the first sentence alone here from Stepanie Yee and Tony Chu is solid:\nIn machine learning, computers apply statistical learning techniques to automatically identify patterns in data. These techniques can be used to make highly accurate predictions.\n\n\n\n\nAnd what …",
          "link": "https://css-tricks.com/a-visual-introduction-to-machine-learning/",
          "publishedOn": "2021-12-17T21:17:31.000Z",
          "wordCount": 568,
          "title": "A visual introduction to machine learning"
        },
        {
          "id": "https://css-tricks.com/?p=357625",
          "author": "Jenn Lukas",
          "description": "What’s one thing we can do to make our site better? Maybe nothing at all!\nOur websites keep getting bigger and bigger! When we have a team with so many exciting ideas and such interesting technology, it can be easy …",
          "link": "https://css-tricks.com/maybe-nothing/",
          "publishedOn": "2021-12-17T15:21:15.000Z",
          "wordCount": 857,
          "title": "Maybe Nothing"
        },
        {
          "id": "https://css-tricks.com/?p=359430",
          "author": "Chris Coyier",
          "description": "Huh! I did not realize that CSS custom properties had their own resolution behavior for how !important works in their values. Uh, despite writing a guide about them. 😬 But hey it’s now updated.\nStefan Judis documents it clearly. …",
          "link": "https://css-tricks.com/the-surprising-behavior-of-important-in-css-custom-property-values/",
          "publishedOn": "2021-12-17T15:19:08.000Z",
          "wordCount": 687,
          "title": "The surprising behavior of !important in CSS custom property values"
        },
        {
          "id": "https://css-tricks.com/?p=358029",
          "author": "Andy Bell",
          "description": "When Chris first sent me this prompt, I was thinking about writing about progressive enhancement, but that subject is so wide-reaching to be one thing and all too predictable, especially for those already familiar with my writing. Saying that, what …",
          "link": "https://css-tricks.com/consistent-fluidly-scaling-type-and-spacing/",
          "publishedOn": "2021-12-16T22:06:03.000Z",
          "wordCount": 1183,
          "title": "Consistent, Fluidly Scaling Type and Spacing"
        },
        {
          "id": "https://css-tricks.com/?p=359260",
          "author": "Chris Coyier",
          "description": "Jordan Scales explores the computer science concept of topological sorting, and what it might look like if applied to the concept of  z-index in CSS. So, you don’t express what the z-index should be directly; instead, you say exactly …",
          "link": "https://css-tricks.com/topological-sort/",
          "publishedOn": "2021-12-16T22:04:07.000Z",
          "wordCount": 571,
          "title": "Topological sort"
        },
        {
          "id": "https://css-tricks.com/?p=359306",
          "author": "Chris Coyier",
          "description": "Three cheers for (draft stage) progress on a Sanitizer API! It’s gospel that you can’t trust user input. And indeed, any app I’ve ever worked on has dealt with bad actors trying to slip in and execute nefarious code …",
          "link": "https://css-tricks.com/html-sanitizer-api/",
          "publishedOn": "2021-12-16T18:21:31.000Z",
          "wordCount": 841,
          "title": "HTML Sanitizer API"
        },
        {
          "id": "https://css-tricks.com/?p=358576",
          "author": "Farai Gandiya",
          "description": "Between Google Chrome experimenting with “following” sites, along with a growing frustration of how social media platforms limit a creator’s reach to their fans through algorithmic feeds, there’s been renewed interest in RSS feeds and they’re primed for a …",
          "link": "https://css-tricks.com/working-with-web-feeds-its-more-than-rss/",
          "publishedOn": "2021-12-16T15:15:11.000Z",
          "wordCount": 5268,
          "title": "Working With Web Feeds: It’s More Than RSS"
        },
        {
          "id": "https://css-tricks.com/?p=359032",
          "author": "Chris Coyier",
          "description": "I was reading Jake’s “Cross-fading any two DOM elements is currently impossible” which is a wonderfully nerdy deep dive into how there is no real way to literally cross-fade elements. Yeah, you can animate both of their opacities, but even …",
          "link": "https://css-tricks.com/maybe-there-kinda-is-background-opacity/",
          "publishedOn": "2021-12-15T22:27:07.000Z",
          "wordCount": 562,
          "title": "Maybe there kinda is background-opacity?"
        },
        {
          "id": "https://css-tricks.com/?p=359234",
          "author": "Chris Coyier",
          "description": "Matias Capeletto covers the breadth of Vite, from the technological shoulders it stands on, to the peers exploring similar territory, to the other technologies it supports, to the frameworks that now use it primarily, and more. The fact that …",
          "link": "https://css-tricks.com/the-vite-ecosystem/",
          "publishedOn": "2021-12-15T20:58:30.000Z",
          "wordCount": 516,
          "title": "The Vite Ecosystem"
        },
        {
          "id": "https://css-tricks.com/?p=358026",
          "author": "Laura Kalbag",
          "description": "Earlier this week, I tried out a starter theme for a blog platform. The theme had loads of nice default features: pretty typography, fancy navigation, dark mode widget… and a couple of default trackers I really don’t want just sitting …",
          "link": "https://css-tricks.com/remove-trackers/",
          "publishedOn": "2021-12-15T15:20:14.000Z",
          "wordCount": 1258,
          "title": "Remove Trackers"
        },
        {
          "id": "https://css-tricks.com/?p=359107",
          "author": "Chris Coyier",
          "description": "Google is handing out bucks for CSS-related projects, so you might as well know about it! Nicole Sullivan:\nAll of us who work on the web regularly benefit from the work of people who create specifications, tools, demos, tutorials, and \n…",
          "link": "https://css-tricks.com/the-ui-fund/",
          "publishedOn": "2021-12-15T15:18:29.000Z",
          "wordCount": 540,
          "title": "The UI fund"
        },
        {
          "id": "https://css-tricks.com/?p=356603",
          "author": "Geoff Graham",
          "description": "When’s the last time you read your website? Like out loud in the lobby of a Starbucks on a weekday afternoon, over the phone to your parents, or perhaps even as a bedtime story for your kids.\nNo worries, this …",
          "link": "https://css-tricks.com/read-your-website/",
          "publishedOn": "2021-12-14T22:37:26.000Z",
          "wordCount": 1533,
          "title": "Read Your Website"
        },
        {
          "id": "https://css-tricks.com/?p=359180",
          "author": "Chris Coyier",
          "description": "Ain’t this the truth:\nIt’s like when you’re learning a new language. At some point your brain goes from translating from your mother tongue into the other language, and instead starts thinking in that other language.\n\n\n\n\nI don’t speak …",
          "link": "https://css-tricks.com/faulty-logic/",
          "publishedOn": "2021-12-14T22:28:29.000Z",
          "wordCount": 715,
          "title": "Faulty logic"
        },
        {
          "id": "https://css-tricks.com/?p=357660",
          "author": "Amit Sheen",
          "description": "What’s the one thing people can do to make their website better? Now that is a good question. One with many right answers, like improving performance, taking care of accessibility, and upgrading user experience as prime examples. These are all …",
          "link": "https://css-tricks.com/think-without-boxes/",
          "publishedOn": "2021-12-14T15:38:00.000Z",
          "wordCount": 779,
          "title": "Think Without Boxes"
        },
        {
          "id": "https://css-tricks.com/?p=358672",
          "author": "Chris Coyier",
          "description": "(This is a sponsored post.)\nI got this question from a listener the other day. Fair question, I’d say. The word “Static” in “Static Site Generator” is at-odds with the word “Dynamic.” It seems to imply that the website …",
          "link": "https://css-tricks.com/confused-about-ssgs/",
          "publishedOn": "2021-12-14T15:35:04.000Z",
          "wordCount": 619,
          "title": "I’m confused about Static Site Generators. Are they only for informational sites where I can’t log in or display any dynamic data?"
        },
        {
          "id": "https://css-tricks.com/?p=358436",
          "author": "Chris Coyier",
          "description": "Ya know, I used to do one of these posts after making a few podcast appearances I hadn’t had a chance to link up yet, so I could share them. As fate would have it, I haven’t been on many …",
          "link": "https://css-tricks.com/css-tricks-chronicle-xxxxi/",
          "publishedOn": "2021-12-13T22:55:14.000Z",
          "wordCount": 1001,
          "title": "CSS-Tricks Chronicle XXXXI"
        },
        {
          "id": "https://css-tricks.com/?p=359002",
          "author": "Chris Coyier",
          "description": "I read a a recent Smashing Magazine post that recommendation Hygen. I just happen to be doing quite a bit of new UI work in a Next.js app and the amount of manual folder/file scaffolding I was doing was …",
          "link": "https://css-tricks.com/file-scaffolding-with-hygen/",
          "publishedOn": "2021-12-13T22:05:20.000Z",
          "wordCount": 861,
          "title": "File Scaffolding With Hygen"
        },
        {
          "id": "https://css-tricks.com/?p=358926",
          "author": "Chris Coyier",
          "description": "Josh’s Shadow Palette Generator is a fantastic tool. The premise is that box-shadow pretty much always looks better when there are multiple layered shadows that are a bit tinted. It reminds me of how gradients almost always look better when …",
          "link": "https://css-tricks.com/shadow-palette-generator/",
          "publishedOn": "2021-12-13T18:13:22.000Z",
          "wordCount": 431,
          "title": "Shadow Palette Generator"
        },
        {
          "id": "https://css-tricks.com/?p=358612",
          "author": "Bramus",
          "description": "So what is the one thing that people can do is to make their website better? To answer that, let’s take a step back in time …\nThe year is 1998, and the web is on the rise. In an …",
          "link": "https://css-tricks.com/embrace-the-platform/",
          "publishedOn": "2021-12-13T15:18:08.000Z",
          "wordCount": 1986,
          "title": "Embrace the Platform"
        },
        {
          "id": "https://css-tricks.com/?p=358450",
          "author": "Chris Coyier",
          "description": "(This is a sponsored post.)\nAmazon has a vision with AWS Amplify. First, a premise:\nAs browsers have become faster and more powerful over the last decade, front-end developers are building web apps that are more feature-rich and …",
          "link": "https://css-tricks.com/ship-a-full-stack-app-in-days-with-aws-amplify-studio/",
          "publishedOn": "2021-12-13T15:17:24.000Z",
          "wordCount": 1149,
          "title": "Ship a Full-Stack App in Days with AWS Amplify Studio"
        }
      ]
    },
    {
      "title": "Articles on Smashing Magazine — For Web Designers And Developers",
      "feedUrl": "https://www.smashingmagazine.com/feed/",
      "siteUrl": "https://www.smashingmagazine.com/",
      "articles": [
        {
          "id": "https://smashingmagazine.com/2022/01/css-radial-conic-gradient/",
          "author": "hello@smashingmagazine.com (Ahmad Shadeed)",
          "description": "In this article, we’ll be taking a closer look at two gradients: `conic-gradient` and `radial-gradient`. You’ll see how each one of them works in detail, what the differences and similarities are between them, how and where to use them, and some use cases for each.",
          "link": "https://smashingmagazine.com/2022/01/css-radial-conic-gradient/",
          "publishedOn": "2022-01-10T12:30:00.000Z",
          "wordCount": 2303,
          "title": "A Deep CSS Dive Into Radial And Conic Gradients",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8b1eea9e-877a-4da7-b531-537a97a44613/css-radial-conic-gradient.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2022/01/changing-tire-on-moving-car/",
          "author": "hello@smashingmagazine.com (Scott Himmer)",
          "description": "Product roadmaps are often treated as a series of checkboxes. But they are more than that. In this article, Scott Himmer explains how internal partnerships, research, design systems, and regular touch bases can help make sure that your product roadmap is a successful one.",
          "link": "https://smashingmagazine.com/2022/01/changing-tire-on-moving-car/",
          "publishedOn": "2022-01-07T16:00:00.000Z",
          "wordCount": 3997,
          "title": "Changing A Tire On A Moving Car (Or How To Improve Product Roadmaps)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/31db8ed2-e433-46b6-9b8e-ab622b10fce0/changing-tire-on-moving-car.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2022/01/ten-tips-aspiring-designer-beginners-part1/",
          "author": "hello@smashingmagazine.com (Luis Ouriach)",
          "description": "In this article (the first part in a series of two), Luis Ouriach shares advice that he wishes he has when starting out in his career. These tips come from his experience as a user interface and product designer for close to ten years, and if you’re starting just now, then read on!",
          "link": "https://smashingmagazine.com/2022/01/ten-tips-aspiring-designer-beginners-part1/",
          "publishedOn": "2022-01-05T13:00:00.000Z",
          "wordCount": 4074,
          "title": "Ten Tips For Aspiring Designer Beginners (Part 1)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/954de2dd-e9df-43de-9b9a-bb24c1f8cf0b/tips-aspiring-designer-beginners-part1.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2022/01/composition-based-design-system-figma/",
          "author": "hello@smashingmagazine.com (Aleksandra Nagornaia)",
          "description": "Figma has advanced enough where it now supports some powerful concepts that can help with the flexibility and maintainability of a design system. In this article, Sasha explains why she finds the Systems Designer position so rewarding — and it’s not only because of how fast certain tools have developed to help her master challenges she faces in her work projects.",
          "link": "https://smashingmagazine.com/2022/01/composition-based-design-system-figma/",
          "publishedOn": "2022-01-03T13:00:00.000Z",
          "wordCount": 2639,
          "title": "Composition-Based Design System In Figma",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/671611c3-eaf7-427e-9e5d-1bb74fbf62f5/composition-based-design-system-figma.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/desktop-wallpaper-calendars-january-2022/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "What better way could there be to start the new year than with some fresh inspiration? Our collection of wallpapers for January 2022 is bound to put a smile on your face — and maybe spark new ideas, too.",
          "link": "https://smashingmagazine.com/2021/12/desktop-wallpaper-calendars-january-2022/",
          "publishedOn": "2021-12-31T09:00:00.000Z",
          "wordCount": 2385,
          "title": "New Year, Fresh Desktop (January 2022 Wallpapers Edition)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/55a76925-9960-4444-a72c-72d8738d5ac8/jan-22-new-years-magic-preview-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/how-price-projects-manage-scope-screep/",
          "author": "hello@smashingmagazine.com (Paul Boag)",
          "description": "Scoping, estimating, and running digital projects can often feel like an exercise in futility. In this article, Paul Boag explains why you need to start breaking your projects down into manageable phases and why that’s the best way to achieve significant benefits.",
          "link": "https://smashingmagazine.com/2021/12/how-price-projects-manage-scope-screep/",
          "publishedOn": "2021-12-29T10:30:00.000Z",
          "wordCount": 2451,
          "title": "How To Price Projects And Manage Scope Screep",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/32b30344-817f-4450-83d8-850f086a9b61/how-price-projects-manage-scope-screep.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/building-gatsby-themes-wordpress-powered-websites/",
          "author": "hello@smashingmagazine.com (Paulina Hetman)",
          "description": "Have you already built and published a Gatsby theme? In this article, Paulina Hetman explains how Gatsby themes work and what problems they can solve by comparing Gatsby themes with their WordPress counterparts.",
          "link": "https://smashingmagazine.com/2021/12/building-gatsby-themes-wordpress-powered-websites/",
          "publishedOn": "2021-12-27T10:30:00.000Z",
          "wordCount": 4227,
          "title": "Building Gatsby Themes For WordPress-Powered Websites",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c5b60a4b-63f6-47e2-a9aa-33faa3e9ca9e/building-gatsby-themes-wordpress-powered-websites.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/create-custom-range-input-consistent-browsers/",
          "author": "hello@smashingmagazine.com (Alyssa Holland)",
          "description": "Range inputs have notoriously been a pain to style. Each browser renders the input differently requiring you to use vendor prefixes in order to create a cohesive look and feel. In this article, we’ll take a look at the quirkiness of the HTML range input and demonstrate how to style the input to look consistent across all major browsers.",
          "link": "https://smashingmagazine.com/2021/12/create-custom-range-input-consistent-browsers/",
          "publishedOn": "2021-12-23T11:00:00.000Z",
          "wordCount": 2608,
          "title": "Creating A Custom Range Input That Looks Consistent Across All Browsers",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0deb2d53-1482-44c1-bf77-4dcc92ce3cd5/create-custom-range-input-consistent-browsers.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/tools-tips-resources-to-build-better-user-experiences/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "A meaningful user experience is what can set your site apart from others. But what makes an experience truly meaningful? And how to achieve that? The tools, tips, and resources in this post not only help you to come up with a UX strategy that works for you and your team but also to circumvent potential UX pitfalls.",
          "link": "https://smashingmagazine.com/2021/12/tools-tips-resources-to-build-better-user-experiences/",
          "publishedOn": "2021-12-22T10:00:00.000Z",
          "wordCount": 4184,
          "title": "Useful UX Guidelines, Tools And Resources",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fb38ba21-df76-4d15-b7ef-bbda38aeea6b/laws-of-ux-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/core-web-vitals-case-study-smashing-magazine/",
          "author": "hello@smashingmagazine.com (Barry Pollard)",
          "description": "How to improve Core Web Vitals, a Smashing Magazine case study on how we detected and fixed the bottlenecks, and how we ended up with green scores, all the way.",
          "link": "https://smashingmagazine.com/2021/12/core-web-vitals-case-study-smashing-magazine/",
          "publishedOn": "2021-12-20T05:30:00.000Z",
          "wordCount": 6014,
          "title": "Improving Core Web Vitals, A Smashing Magazine Case Study",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/88f0021e-6f6e-4570-954f-eab757e4485b/core-web-vitals-case-study-smashing-magazine.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/designing-human-machine-interfaces-future-vehicles/",
          "author": "hello@smashingmagazine.com (Nick Babich & Gleb Kuznetsov)",
          "description": "Modern HMIs are transforming the way we interact with our vehicles. A car becomes a gadget that we use in a similar way as we use our phones. Users expect a lot of HMI, they even evaluate car experience based on the experience they have with HMI. In this article, let’s look at some ways to help us satisfy users’ needs with proper design.",
          "link": "https://smashingmagazine.com/2021/12/designing-human-machine-interfaces-future-vehicles/",
          "publishedOn": "2021-12-17T14:30:00.000Z",
          "wordCount": 3396,
          "title": "Designing Human-Machine Interfaces For Vehicles Of The Future",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3d9f919a-44bf-46ef-bfff-ee673c58e83f/designing-human-machine-interfaces-future-vehicles.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/billing-management-saas-stripe-azure-functions/",
          "author": "hello@smashingmagazine.com (Nwani Victory)",
          "description": "In every software-as-a-service solution, user billing and payments are key aspects in the sale of services rendered. Let’s learn about Stripe and how the REST API can be programmatically used in serverless functions to manage the billing for an application.",
          "link": "https://smashingmagazine.com/2021/12/billing-management-saas-stripe-azure-functions/",
          "publishedOn": "2021-12-17T13:30:00.000Z",
          "wordCount": 5437,
          "title": "Billing Management For Your Next SaaS Idea Using Stripe And Azure Functions",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/346f3641-b7be-486d-8ac9-327ffe00e232/billing-management-saas-stripe-azure-functions.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/touch-design-mobile-interfaces-devices/",
          "author": "hello@smashingmagazine.com (Steven Hoober)",
          "description": "Before we can talk about how people interact, much less how to take advantage of that knowledge and design, it’s important to understand a bit about the history, the technology, and what today counts as a mobile touchscreen device at all.",
          "link": "https://smashingmagazine.com/2021/12/touch-design-mobile-interfaces-devices/",
          "publishedOn": "2021-12-15T11:30:00.000Z",
          "wordCount": 2499,
          "title": "Touch Design For Mobile Interfaces: Defining Mobile Devices (Excerpt)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9e9a3814-1de8-4be8-87c4-a14712d76776/1-touch-design-mobile-interfaces-devices.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/12/headers-https-requests-ui-automation-testing/",
          "author": "hello@smashingmagazine.com (Nafees Nehar)",
          "description": "To be able to modify headers in a testing environment is a great thing to have. It allows control over your application as one can bypass authentication, set cookies, and so on. In this article, Nafees Nehar explores some methods which allow modification of headers in an automation testing setup.",
          "link": "https://smashingmagazine.com/2021/12/headers-https-requests-ui-automation-testing/",
          "publishedOn": "2021-12-14T10:30:00.000Z",
          "wordCount": 2062,
          "title": "Modifying Headers In HTTP(s) Requests In UI Automation Testing",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8590d77e-8181-4d36-9e2e-d4e9c76a893a/headers-https-requests-ui-automation-testing.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "61db119ad2d9de084285f51f",
          "author": null,
          "description": "One of the most important composite data types in Python is the dictionary. It's a collection you use to store data in {key:value} pairs.  Dictionaries are ordered and mutable, and they cannot store duplicate data. Just keep in mind that before Python 3.6, dictionaries were unordered. Alright, let's",
          "link": "https://www.freecodecamp.org/news/everything-you-need-to-know-about-python-dictionaries/",
          "publishedOn": "2022-01-11T19:05:01.000Z",
          "wordCount": 1540,
          "title": "Python Dictionary – How to Perform CRUD Operations on dicts in Python"
        },
        {
          "id": "61ddb353b837d507ba09fd7b",
          "author": null,
          "description": "It may sound surprising, but you already have all it takes to produce high-level logic: right behind your eyes.  In the first term of college, I was introduced to a subject called Logic. In the \"I think, therefore I am\" fashion, you might think this would be an easy subject.",
          "link": "https://www.freecodecamp.org/news/propositional-logic-for-beginners/",
          "publishedOn": "2022-01-11T18:41:47.000Z",
          "wordCount": 1584,
          "title": "Propositional Logic for Beginners – You Already Know More Than You Think"
        },
        {
          "id": "61d70293d2d9de084285d502",
          "author": null,
          "description": "What is Margin Collapse?Margin collapse occurs when vertically adjacent margins of block-level elements collide to share a general margin space. The size of this shared space is dictated by the larger number margin.  You can visualize this as an arm wrestling match, where the larger margin will take over",
          "link": "https://www.freecodecamp.org/news/what-is-margin-collapse-and-how-to-avoid-it/",
          "publishedOn": "2022-01-11T18:07:52.000Z",
          "wordCount": 1081,
          "title": "What is Margin Collapse in CSS? And How to Avoid It"
        },
        {
          "id": "61daa098d2d9de084285f0e9",
          "author": null,
          "description": "Search algorithms are a fundamental computer science concept that you should understand as a developer. They work by using a step-by-step method to locate specific data among a collection of data. In this article, we'll learn how search algorithms work by looking at their implementations in Java and Python. What",
          "link": "https://www.freecodecamp.org/news/search-algorithms-linear-and-binary-search-explained/",
          "publishedOn": "2022-01-11T17:21:54.000Z",
          "wordCount": 1750,
          "title": "Search Algorithms – Linear Search and Binary Search Code Implementation and Complexity Analysis"
        },
        {
          "id": "61d304e0d2d9de084285afc8",
          "author": null,
          "description": "What is DynamoDB?DynamoDB is a fully managed NoSQL database from AWS. DynamoDB is similar to other NoSQL databases like MongoDB, except for the fact that you don’t have to do any maintenance or scaling on your part. DynamoDB can handle more than 10 trillion requests per day and",
          "link": "https://www.freecodecamp.org/news/aws-dynamodb-database-guide-for-beginners/",
          "publishedOn": "2022-01-11T16:50:00.000Z",
          "wordCount": 1179,
          "title": "AWS DynamoDB – NoSQL Database Guide for Beginners"
        },
        {
          "id": "601617d60a2838549dcbb553",
          "author": null,
          "description": "It's a bit tricky to explain what exactly a file system is in just one sentence. That's why I decided to write an article about it. This post is meant to be a high-level overview of file systems. But I'll sneak into the lower-level concepts as well, as long as",
          "link": "https://www.freecodecamp.org/news/file-systems-architecture-explained/",
          "publishedOn": "2022-01-11T16:49:00.000Z",
          "wordCount": 6927,
          "title": "What Is a File System? Types of Computer File Systems and How they Work – Explained with Examples"
        },
        {
          "id": "61d6aae9d2d9de084285cfdc",
          "author": null,
          "description": "As a JavaScript beginner, you probably learned how to declare variables and assign values.  In the old, pre-ES6 era of JavaScript, developers used to declare variables using the keyword var or without any keywords. But times have changed! With ES6 (EcmaScript 2015), the beginning of the modern era in JavaScript,",
          "link": "https://www.freecodecamp.org/news/understanding-let-const-and-var-keywords/",
          "publishedOn": "2022-01-11T16:47:43.000Z",
          "wordCount": 1573,
          "title": "How the let, const, and var Keywords Work in JavaScript"
        },
        {
          "id": "61d8d033d2d9de084285e93e",
          "author": null,
          "description": "Web forms play an important role on many sites on the internet, and they're something you should know how to build as a web developer.  From good ol' login forms to signup forms and survey forms (or whatever they're called these days), their main purpose is to receive data and",
          "link": "https://www.freecodecamp.org/news/how-to-send-the-right-data-type-from-a-form-to-the-backend-server/",
          "publishedOn": "2022-01-10T21:30:48.000Z",
          "wordCount": 2408,
          "title": "How to Convert react-dropdown-select&#x27;s Default Value from Array to String"
        },
        {
          "id": "61d54372d2d9de084285c327",
          "author": null,
          "description": "If you need to split up a string into an array of substrings, then you can use the JavaScript split() method.  In this article, I will go over the JavaScript split() method and provide code examples.  Basic Syntax of the split() methodHere is the syntax for the JavaScript split() method.",
          "link": "https://www.freecodecamp.org/news/javascript-split-a-string-string-to-array-js-method/",
          "publishedOn": "2022-01-10T21:24:30.000Z",
          "wordCount": 927,
          "title": "JavaScript split() a String – String to Array JS Method"
        },
        {
          "id": "61dc51e5b837d507ba09edb6",
          "author": null,
          "description": "So you're ready to dive into learning React, but you still have some lingering questions, such as: How should I create my React projects?What tools should I add to my React app?Do I need to learn JavaScript first before learning React?Where should I deploy my projects?If",
          "link": "https://www.freecodecamp.org/news/react-beginners-guide/",
          "publishedOn": "2022-01-10T21:15:23.000Z",
          "wordCount": 2335,
          "title": "The React Beginner&#x27;s Guide for 2022"
        },
        {
          "id": "61d18c23a700150888933e31",
          "author": null,
          "description": "In this article, we will discuss how to push a commit in Git without making any changes. Git makes this process of pushing an empty commit super simple. It's like pushing a regular commit, except that you add the --allow-empty flag. git commit --allow-empty -m \"Empty-Commit\"You will now need",
          "link": "https://www.freecodecamp.org/news/how-to-push-an-empty-commit-with-git/",
          "publishedOn": "2022-01-10T21:04:19.000Z",
          "wordCount": 358,
          "title": "How to Push an Empty Commit in Git"
        },
        {
          "id": "61c8e4b1755c16082490b4e4",
          "author": null,
          "description": "During a recent project update meeting, my team talked about how we were going to use serialization to send data back and forth from this application.  An engineer who was looking to get more into software projects told me that they were unfamiliar with the term.  It's easy to miss",
          "link": "https://www.freecodecamp.org/news/what-is-serialization/",
          "publishedOn": "2022-01-10T21:00:00.000Z",
          "wordCount": 1132,
          "title": "What is Serialization?"
        },
        {
          "id": "61d98981d2d9de084285ed1d",
          "author": null,
          "description": "In this article you'll learn how to create a text input field in HTML. You'll also learn about web forms and get an overview of how they work, since text boxes are a common feature of every form.  Let's get started!  What are Web Forms? Forms are an efficient way",
          "link": "https://www.freecodecamp.org/news/text-box-in-html-the-input-field-html-tag/",
          "publishedOn": "2022-01-10T20:02:45.000Z",
          "wordCount": 2436,
          "title": "Text Box in HTML – The Input Field HTML Tag"
        },
        {
          "id": "61dc8201b837d507ba09f359",
          "author": null,
          "description": "React is still one of the most popular JavaScript libraries for building user interfaces. If you are a front-end developer, it is super helpful to know React. We just published a brand-new, 12-hour React course on the freeCodeCamp.org YouTube channel. In this course, you will React by building eight",
          "link": "https://www.freecodecamp.org/news/free-react-course-2022/",
          "publishedOn": "2022-01-10T19:10:48.000Z",
          "wordCount": 495,
          "title": "Free React Course for 2022"
        },
        {
          "id": "61d99c82d2d9de084285ee28",
          "author": null,
          "description": "I love working with GitHub Actions. They're easy to use yet so powerful. I'm especially excited when I see how creative people are when using them to automate different tasks.  I want you to have that same power. That's why I'm going to show you how to create your first",
          "link": "https://www.freecodecamp.org/news/build-your-first-javascript-github-action/",
          "publishedOn": "2022-01-10T17:36:34.000Z",
          "wordCount": 2555,
          "title": "How to Build Your First JavaScript GitHub Action"
        },
        {
          "id": "61d81b30d2d9de084285e181",
          "author": null,
          "description": "Have you ever visited a website and been totally blown away by its amazing features? One of them might be a cool mouse cursor that is different from the regular arrow or pointer cursors you are used to.   This can really improve user experience, and lately I've been wondering how",
          "link": "https://www.freecodecamp.org/news/how-to-make-a-custom-mouse-cursor-with-css-and-javascript/",
          "publishedOn": "2022-01-10T16:13:35.000Z",
          "wordCount": 1211,
          "title": "How to Make a Custom Mouse Cursor with CSS and JavaScript"
        },
        {
          "id": "61d5406cd2d9de084285c2ef",
          "author": null,
          "description": "So, now that you've published your first open-source project, what next? If you're new to open source, you might think this is it. But the fun has just begun. In fact, most of the work lies in maintaining your project and making it accessible to more users. This is one",
          "link": "https://www.freecodecamp.org/news/how-to-maintain-an-open-source-project/",
          "publishedOn": "2022-01-10T14:52:54.000Z",
          "wordCount": 1446,
          "title": "How to Maintain an Open Source Project – Best Practices and Tips"
        },
        {
          "id": "61d6e37ad2d9de084285d220",
          "author": null,
          "description": "In this post we're going to get all the headings from a freeCodeCamp blog post to make a Table of Contents (ToC) in Ghost CMS. I recently published quite a large post here on freeCodeCamp and needed to add a table of contents to the post. There's a really good",
          "link": "https://www.freecodecamp.org/news/how-to-get-headings-and-ids-for-your-freecodecamp-blog-posts/",
          "publishedOn": "2022-01-07T21:31:15.000Z",
          "wordCount": 941,
          "title": "How to Get Headings and IDs for Your freeCodeCamp Blog Post Table of Contents"
        },
        {
          "id": "61d7e914d2d9de084285df19",
          "author": null,
          "description": "Have you ever sat down to write some code or browse the internet, only to discover that your keyboard isn't working?  When your keyboard fails to work, it could be due to:  Physical damage Dirt Filter keys Outdated or corrupt driver Low battery (if you're using an external keyboard). You",
          "link": "https://www.freecodecamp.org/news/keyboard-not-working-how-to-fix-windows-10-keyboard-not-typing-problem/",
          "publishedOn": "2022-01-07T21:00:30.000Z",
          "wordCount": 740,
          "title": "Keyboard Not Working? How to Fix Windows 10 Keyboard Not Typing Problem"
        },
        {
          "id": "61d74f40d2d9de084285da90",
          "author": null,
          "description": "When you're learning the basics of most programming languages, you are bound to come across operators.  In this tutorial, we will talk about the not equal operator in Python and also see a few examples of how it works.  Operators and Operands in PythonBefore talking about the not equal operator,",
          "link": "https://www.freecodecamp.org/news/python-not-equal-how-to-use-the-does-not-equal-operator/",
          "publishedOn": "2022-01-07T18:16:14.000Z",
          "wordCount": 1119,
          "title": "Python Not Equal – Does Not Equal Operator Tutorial"
        },
        {
          "id": "6181e65c8bcfae07ca4e068b",
          "author": null,
          "description": "In this tutorial, you will learn how to work in a team with a central repository on GitHub. You will work on issues, commits, pull requests, code reviews, and more. I don't consider myself an expert on Git, but I have learned a lot about it in my first month",
          "link": "https://www.freecodecamp.org/news/how-to-use-git-and-github-in-a-team-like-a-pro/",
          "publishedOn": "2022-01-07T18:13:40.000Z",
          "wordCount": 3374,
          "title": "How to Use Git and GitHub in a Team like a Pro – Featuring Harry and Hermione 🧙"
        },
        {
          "id": "61c8aeac755c16082490b36c",
          "author": null,
          "description": "In this article, you'll learn about the .append() method in Python.  You'll also see how .append() differs from other methods used to add elements to lists.  Let's get started!  What are lists in Python? A definition for beginners An array in programming is an ordered collection of items, and all",
          "link": "https://www.freecodecamp.org/news/append-in-python-how-to-append-to-a-list-or-an-array/",
          "publishedOn": "2022-01-07T17:41:31.000Z",
          "wordCount": 1897,
          "title": "Append in Python – How to Append to a List or an Array"
        },
        {
          "id": "61d7ed4ad2d9de084285df89",
          "author": null,
          "description": "On Windows 10 and other versions of the Windows operating system, you need a network adapter to connect to the internet through a wired or wireless network.  Sometimes, you might get an error that your network adapter is missing. This can be very frustrating because you won't be able to",
          "link": "https://www.freecodecamp.org/news/windows-10-network-adapter-missing-how-to-install-ethernet-driver-on-pc/",
          "publishedOn": "2022-01-07T16:34:05.000Z",
          "wordCount": 789,
          "title": "Windows 10 Network Adapter Missing – How to Install Ethernet Driver on PC"
        },
        {
          "id": "61c63165755c16082490aaf2",
          "author": null,
          "description": "Pie charts are common components that let you show portions of a whole, and you can use them for many different purposes.  You will find a lot of articles around building such a component, but they typically either rely on SVG or a lot of HTML elements.  In this post,",
          "link": "https://www.freecodecamp.org/news/css-only-pie-chart/",
          "publishedOn": "2022-01-06T20:41:44.000Z",
          "wordCount": 1729,
          "title": "How to Create a Pie Chart Using Only CSS"
        },
        {
          "id": "61d21460a7001508889343d7",
          "author": null,
          "description": "Two years out of coding bootcamp and I had an incredible offer from one of the world’s most highly-regarded tech companies…and I declined it. On paper, it was the dream job. Heck, it would have been the most “adult” job I’d ever had in my life so",
          "link": "https://www.freecodecamp.org/news/why-i-turned-down-a-six-figure-salary-in-big-tech-to-stay-at-a-five-person-startup/",
          "publishedOn": "2022-01-06T18:13:50.000Z",
          "wordCount": 3762,
          "title": "Why I Turned Down a Six-Figure Salary in Big Tech to Stay at a Five-Person Startup"
        },
        {
          "id": "61d716e6d2d9de084285d794",
          "author": null,
          "description": "To improve your skills in machine learning and artificial intelligence, it is important to solve real-world problems. What better problem to solve then helping to save people's lives? Machine learning is being used more and more in the field of healthcare. PyTorch and Monai can be used to discover tumors",
          "link": "https://www.freecodecamp.org/news/pytorch-and-monai-for-healthcare-imaging/",
          "publishedOn": "2022-01-06T16:30:57.000Z",
          "wordCount": 347,
          "title": "Real-World Machine Learning—PyTorch and Monai for Healthcare Imaging"
        },
        {
          "id": "61d4d739d2d9de084285c147",
          "author": null,
          "description": "Material UI's Data Grid is a powerful and flexible data table. It makes it easy for you to display data and perform out of the box functionalities such as editing, sorting, filtering, pagination and more. In this article, we'll discuss why you should use the Data Grid in Material UI",
          "link": "https://www.freecodecamp.org/news/how-to-integrate-material-ui-data-grid-in-react-using-data-from-a-rest-api/",
          "publishedOn": "2022-01-06T16:30:56.000Z",
          "wordCount": 1656,
          "title": "How to Integrate the Material UI Data Grid in React Using Data from a REST API"
        },
        {
          "id": "6193e30c11d3cb08287a7189",
          "author": null,
          "description": "A developer portfolio is a great way to showcase your current skill level to potential employers.  This guide will go from hello world to a fully-featured portfolio project to show your current projects with images and links to source code. You'll also build an accompanying blog where you can detail",
          "link": "https://www.freecodecamp.org/news/build-your-developer-portfolio-from-scratch-with-sveltekit-and-graphcms/",
          "publishedOn": "2022-01-06T16:12:00.000Z",
          "wordCount": 11455,
          "title": "Build your Developer Portfolio and Blog from Scratch with Svelte and GraphCMS – A Complete Guide"
        },
        {
          "id": "61c53829755c16082490a517",
          "author": null,
          "description": "The Web Content Accessibility Guidelines, or WCAG, defines how to make websites accessible for people with disabilities.  When we evaluate whether or not website is accessible, we look to see if software meets WCAG 2 standards.  Accessibility should not be an after thought, but rather a major part of the",
          "link": "https://www.freecodecamp.org/news/common-accessibility-errors-and-how-to-fix-them/",
          "publishedOn": "2022-01-05T21:15:24.000Z",
          "wordCount": 1635,
          "title": "Common Accessibility Errors and How To Fix Them"
        },
        {
          "id": "61d2fb81d2d9de084285afb4",
          "author": null,
          "description": "In this post, we are going to see how we can create a REST API application for authentication using AWS Cognito, AWS Serverless, and NodeJS.  We are going to use Lambda functions, API Gateway, and the Serverless framework to achieve this. Let’s start by setting up the project. Project",
          "link": "https://www.freecodecamp.org/news/aws-cognito-authentication-with-serverless-and-nodejs/",
          "publishedOn": "2022-01-05T20:15:00.000Z",
          "wordCount": 1883,
          "title": "How to Set Up AWS Cognito Authentication with Serverless and NodeJS"
        },
        {
          "id": "61d5d077d2d9de084285c670",
          "author": null,
          "description": "Figma is a vector graphics editor and prototyping tool that is often used for UI design.  We just published a 10-hour Figma course that will teach you how to use the tool for UI design. Joseph Brendan developed this course. Joseph is a great instructor who has taught thousands of",
          "link": "https://www.freecodecamp.org/news/ui-design-with-figma-tutorial/",
          "publishedOn": "2022-01-05T18:46:36.000Z",
          "wordCount": 370,
          "title": "UI Design with Figma - Tutorial"
        },
        {
          "id": "61c60601755c16082490aa7f",
          "author": null,
          "description": "I want to improve my Rust skills, and help you hone yours as well. So I've decided to write a series of articles about the Rust programing language.  By actually building stuff with Rust, we'll learn about a wide range of technological concepts in the process. In this installment, we’",
          "link": "https://www.freecodecamp.org/news/implement-naive-bayes-with-rust/",
          "publishedOn": "2022-01-05T17:53:04.000Z",
          "wordCount": 2562,
          "title": "How to Implement a Naive Bayes Classifier with Rust"
        },
        {
          "id": "61d1d7fda7001508889341ad",
          "author": null,
          "description": "Have you ever needed to rename a Git branch? If so, this article will assist you in resolving the problem. Git makes it simple to rename a git branch both locally and remotely. Let's take a look at the solution. Why would you need to rename a branch in Git?",
          "link": "https://www.freecodecamp.org/news/how-to-rename-local-and-remote-git-branch/",
          "publishedOn": "2022-01-05T17:19:49.000Z",
          "wordCount": 444,
          "title": "How to Rename a Local and Remote Branch in Git"
        },
        {
          "id": "61d392f6d2d9de084285b76f",
          "author": null,
          "description": "Noodling about on Discord today, the same question came up a few times on a few different servers. I thought it was a great question, and it seems my brain doesn't work quite the way others might expect.  Here's the question: \"So I have a fetch function, and I'm doing",
          "link": "https://www.freecodecamp.org/news/how-to-handle-async-callbacks-in-javascript/",
          "publishedOn": "2022-01-04T23:38:48.000Z",
          "wordCount": 1906,
          "title": "How to Handle Async Callbacks in JavaScript...Without Callbacks?"
        },
        {
          "id": "61d1c911a700150888933fb8",
          "author": null,
          "description": "When first introduced to Git, it's typical for developers to feel uncomfortable with the process.  You might feel uncertainty when encountering the Git commit message, unsure how to properly summarize the changes you've made and why you've made them. But the earlier in your career you can develop good committing",
          "link": "https://www.freecodecamp.org/news/how-to-write-better-git-commit-messages/",
          "publishedOn": "2022-01-04T22:34:45.000Z",
          "wordCount": 1774,
          "title": "How to Write Better Git Commit Messages – A Step-By-Step Guide"
        },
        {
          "id": "61d3917cd2d9de084285b707",
          "author": null,
          "description": "In this tutorial, we'll go over how you can open the VS Code text editor (Visual Studio Code) from your Mac terminal.  Opening your text editor from your terminal is a quick, easy way to open up new projects and begin coding faster.  How to Download and Open VS CodeThe",
          "link": "https://www.freecodecamp.org/news/how-to-open-visual-studio-code-from-your-terminal/",
          "publishedOn": "2022-01-04T21:13:11.000Z",
          "wordCount": 459,
          "title": "How to Open Visual Studio Code From Your Terminal"
        },
        {
          "id": "61c1ad52755c160824908a23",
          "author": null,
          "description": "In this article, you'll learn what meta tags are in HTML and how to use them. Then we'll go over some of the most important meta tags that you need to include in every new HTML project.  Let's get started!  How to set up an HTML project When setting up",
          "link": "https://www.freecodecamp.org/news/meta-tag-in-html-what-is-metadata-and-meta-description-example/",
          "publishedOn": "2022-01-04T18:52:11.000Z",
          "wordCount": 1463,
          "title": "Meta Tag in HTML – What is Metadata and Meta Description Example"
        },
        {
          "id": "61d22dd0a700150888934505",
          "author": null,
          "description": "A long, long time ago – back in late November, 2021 to be precise – I wrote \"A Data Analysis of IT Career Training Tool Efficacy\" to help with the difficult task of making smart career education choices.  Believe it or not, there have already been some important updates. That article began",
          "link": "https://www.freecodecamp.org/news/types-of-software-development-training-new-data-for-choosing-the-best-it-career-training-resource/",
          "publishedOn": "2022-01-04T17:59:53.000Z",
          "wordCount": 1240,
          "title": "Types of Software Development Training – New Data for Choosing the Best IT Career Training Resource"
        },
        {
          "id": "61d1a886a700150888933e3c",
          "author": null,
          "description": "Whenever you're designing a card in HTML, box shadows play a vital role in making the cards stand out.  Whether its a pricing page card or even an e-commerce product listing card, box shadows can make or break the look and the entire message that that cards need to convey.",
          "link": "https://www.freecodecamp.org/news/how-to-create-beautiful-box-shadows-in-html-and-css/",
          "publishedOn": "2022-01-04T16:57:11.000Z",
          "wordCount": 1364,
          "title": "How to Create Beautiful Box Shadows in HTML and CSS"
        },
        {
          "id": "6176cded33422e07df363fa2",
          "author": null,
          "description": "As developers, we all use some form of version control system, and the most popular one is Git.  A lot of us use Git, but very few know how it really works under the hood. We mostly just use it with a GUI client or the ones built into our",
          "link": "https://www.freecodecamp.org/news/git-under-the-hood/",
          "publishedOn": "2022-01-04T16:34:00.000Z",
          "wordCount": 2811,
          "title": "How Git Works Under the Hood"
        },
        {
          "id": "61c05f65aabf6478ea746281",
          "author": null,
          "description": "As a software developer, part of your job is to deliver the best user experience possible to those using your site or product.  And building a helpful and efficient search function is one way you can do this. So if you are looking for the right way to build out",
          "link": "https://www.freecodecamp.org/news/how-to-add-search-to-frontend-app/",
          "publishedOn": "2022-01-04T16:28:58.000Z",
          "wordCount": 2139,
          "title": "How to Add Search Functionality to a Frontend Application"
        },
        {
          "id": "61c55981755c16082490a553",
          "author": null,
          "description": "By default, Linux OS does not automount any other partition at startup other than the root and the home partition.  You can mount other partitions very easily later, but you might want to enable some kind of automount feature on startup. This means that you won't need to mount them",
          "link": "https://www.freecodecamp.org/news/automount-a-storage-partition-on-startup-in-linux/",
          "publishedOn": "2022-01-04T16:09:16.000Z",
          "wordCount": 949,
          "title": "How to Automount a Storage Partition on Startup in Linux"
        },
        {
          "id": "61cfe874a7001508889339e4",
          "author": null,
          "description": "In this article, I will walk you through an example that will show you how web workers function in JavaScript with the help of WebSockets.  I think it's helpful to work with a practical use case because it is much simpler to understand the concepts when you can relate them",
          "link": "https://www.freecodecamp.org/news/how-webworkers-work-in-javascript-with-example/",
          "publishedOn": "2022-01-04T00:31:54.000Z",
          "wordCount": 3582,
          "title": "How Web Workers Work in JavaScript – With a Practical JS Example"
        },
        {
          "id": "61bd0e47297c7107e8ad859b",
          "author": null,
          "description": "HTML is the backbone of any website. It's the first thing people see. Without it, there would be no website.  Because of this, it's important that you stick to good coding practices. If you don't follow the best practices, you will create a bad user experience for the web user.",
          "link": "https://www.freecodecamp.org/news/html-best-practices/",
          "publishedOn": "2022-01-03T23:42:00.000Z",
          "wordCount": 1739,
          "title": "HTML Best Practices – How to Build a Better HTML-Based Website"
        },
        {
          "id": "61b0b0b1946db661defb8a7c",
          "author": null,
          "description": "It is difficult to imagine a business that operates without at least some basic IT infrastructure.  Digital solutions and hardware that are linked together help boost a company's productivity. And good infrastructure improves internal processes and communication between different departments. IT infrastructure is based on various components that aim to",
          "link": "https://www.freecodecamp.org/news/what-is-it-infrastructure/",
          "publishedOn": "2022-01-03T22:24:55.000Z",
          "wordCount": 1822,
          "title": "What is IT Infrastructure? A Beginner&#x27;s Guide"
        },
        {
          "id": "61c5d090755c16082490a758",
          "author": null,
          "description": "Having a \"back to top\" button on a website is important. It allows users to easily scroll back to the top of the page.  Most websites rely on JavaScript to toggle the visibility of the button based on the amount of scroll. In this post, I will show you how",
          "link": "https://www.freecodecamp.org/news/css-only-back-to-top-button/",
          "publishedOn": "2022-01-03T21:18:12.000Z",
          "wordCount": 1612,
          "title": "How to Make an Animated Back to Top Button Using Only CSS"
        },
        {
          "id": "61c823d0755c16082490af8f",
          "author": null,
          "description": "In this tutorial, we will build a URL shortener using Flask. This tool takes any URL and generates a shorter, more readable version like bit.ly.  The application will allow users to enter a URL and an optional custom short id and generate a shorter version. Here's what we're going",
          "link": "https://www.freecodecamp.org/news/python-tutorial-how-to-create-a-url-shortener-using-flask/",
          "publishedOn": "2022-01-03T18:26:36.000Z",
          "wordCount": 3451,
          "title": "Python Tutorial – How to Create a URL Shortener using Flask"
        },
        {
          "id": "61bf7fab297c7107e8ad90d5",
          "author": null,
          "description": "When you start learning to code, one of the questions you probably ask yourself is \"What lannguage should I learn first?\"  One of the most exciting – and at times overwhelming – things about learning to code is just how much there is to learn.  But instead of just focusing",
          "link": "https://www.freecodecamp.org/news/computer-coding-computer-program-definition-and-code-meaning/",
          "publishedOn": "2022-01-03T17:32:46.000Z",
          "wordCount": 2398,
          "title": "Computer Coding – Computer Program Definition and Code Meaning"
        },
        {
          "id": "61b207db946db661defb945e",
          "author": null,
          "description": "Java is a really popular programming language that has been around for over 25+ years. If you are interested in learning Java, then there are plenty of free online courses to choose from. Java Tutorial for Beginners - Programming with MoshJava Course - SoloLearnJava Programming: Solving Problems with Software -",
          "link": "https://www.freecodecamp.org/news/learn-java-free-java-courses-for-beginners/",
          "publishedOn": "2022-01-03T17:06:06.000Z",
          "wordCount": 548,
          "title": "Learn Java – Free Java Courses for Beginners"
        },
        {
          "id": "61cb5f2f755c16082490be2f",
          "author": null,
          "description": "2021 has been a big year for the freeCodeCamp community: We provided more than 2.1 billion minutes of learning to millions of people around the world.We published our 300-hour Relational Database Certification teaching SQL, Linux, and Git interactively – right inside VS Code.We shipped a project-oriented learning overhaul",
          "link": "https://www.freecodecamp.org/news/free-accredited-bachelors-degrees-in-computer-science-how-do-we-get-there/",
          "publishedOn": "2021-12-31T16:26:19.000Z",
          "wordCount": 1555,
          "title": "A Free Accredited Bachelor&#x27;s Degree in Computer Science – How Do We Get There?"
        },
        {
          "id": "61cdc903a700150888933394",
          "author": null,
          "description": "Every year, millions of people create New Year's Resolutions. A vast majority of these will fail. But I've created one for you that I'm optimistic you can succeed with. This is all free and you'll learn a ton. There will be a lot of other people doing this challenge alongside",
          "link": "https://www.freecodecamp.org/news/2022-become-a-dev-new-years-resolution-challenge/",
          "publishedOn": "2021-12-30T15:54:07.000Z",
          "wordCount": 1013,
          "title": "Take the 2022 Become-a-Dev New Year&#x27;s Resolution Challenge"
        },
        {
          "id": "61cdb310a70015088893319b",
          "author": null,
          "description": "2021 was a big year for the freeCodeCamp community: We provided more than 2.1 billion minutes of learning to millions of people around the world.We published our 300-hour Relational Database Certification teaching SQL, Linux, and Git interactively – right inside VS Code.We shipped a project-oriented learning overhaul to",
          "link": "https://www.freecodecamp.org/news/2021-top-contributors/",
          "publishedOn": "2021-12-30T14:56:08.000Z",
          "wordCount": 1562,
          "title": "The Top freeCodeCamp Contributors of 2021"
        },
        {
          "id": "61c9fcdc755c16082490bbcb",
          "author": null,
          "description": "We just published a significant overhaul of our Responsive Web Design Certification (the first of freeCodeCamp's 10 currently-live certifications). We also updated our code editor. Instead of coding lessons, you'll learn concepts and syntax through a series of 15 practice projects + 5 certification projects. Here is the full certification, which",
          "link": "https://www.freecodecamp.org/news/responsive-web-design-certification-redesigned/",
          "publishedOn": "2021-12-27T22:16:19.000Z",
          "wordCount": 1378,
          "title": "Learn Responsive Web Design by Building 20 Projects – a Major freeCodeCamp Curriculum Update"
        },
        {
          "id": "61c71ca4755c16082490adbc",
          "author": null,
          "description": "Julia is a high-level, dynamic programming language, designed to give users the speed of C/C++ while remaining as easy to use as Python. This means that developers can solve problems faster and more effectively. Julia is great for computational complex problems. Many early adopters of Julia were concentrated in",
          "link": "https://www.freecodecamp.org/news/learn-julia-programming-language/",
          "publishedOn": "2021-12-27T17:13:56.000Z",
          "wordCount": 3344,
          "title": "Learn Julia For Beginners – The Future Programming Language of  Data Science and Machine Learning Explained"
        },
        {
          "id": "61c4e1e6755c16082490a3fe",
          "author": null,
          "description": "A Three-tier web applications has a presentation layer, an application layer, and a database layer.  This familiar pattern is fertile ground for learning new technologies like the AWS Cloud Development Kit (CDK).  In this tutorial, we will create a simple note-taking application using a DynamoDB table, HTTP API endpoints, Lambda",
          "link": "https://www.freecodecamp.org/news/aws-cdk-v2-three-tier-serverless-application/",
          "publishedOn": "2021-12-25T21:32:22.000Z",
          "wordCount": 4026,
          "title": "AWS CDK v2 Tutorial – How to Create a Three-Tier Serverless Application"
        },
        {
          "id": "61c3b72d755c160824909987",
          "author": null,
          "description": "Last Thursday, a vulnerability was disclosed in the Log4J logging library affecting many Java applications worldwide.  The vulnerability is called Log4Shell (CVE-2021–44228). It allows an attacker to inject a crafted payload anywhere in the requests that get parsed and executed by the vulnerable application. There are a lot of",
          "link": "https://www.freecodecamp.org/news/java-log4jshell-vulnerability/",
          "publishedOn": "2021-12-23T21:01:00.000Z",
          "wordCount": 1376,
          "title": "Java Log4JShell Vulnerability – What I Learned About it This Week"
        },
        {
          "id": "61c49108755c160824909f76",
          "author": null,
          "description": "First: what you probably came here for. Here's the full soundtrack to Learn to Code RPG. 36 minutes of jazz. If you dig it, subscribe to my new music channel and leave a comment with feedback or your favorite track. I am currently uploading this to Spotify. How I Made",
          "link": "https://www.freecodecamp.org/news/learn-to-code-rpg-soundtrack/",
          "publishedOn": "2021-12-23T18:53:07.000Z",
          "wordCount": 840,
          "title": "Learn to Code RPG – Full Soundtrack + How I Made It"
        },
        {
          "id": "61c1fc40755c160824908ad5",
          "author": null,
          "description": "Since SVG images can be inlined in HTML, we can manipulate them with JavaScript. This means that we can animate parts of an image from code, make it interactive, or turn things around and generate graphics from data. In this example, we are going to create a watch. We will",
          "link": "https://www.freecodecamp.org/news/svg-javascript-tutorial/",
          "publishedOn": "2021-12-23T17:19:15.000Z",
          "wordCount": 2390,
          "title": "SVG + JavaScript Tutorial – How to Code an Animated Watch"
        },
        {
          "id": "61c3059b755c1608249092e9",
          "author": null,
          "description": "Gone are the days when Linux and Windows were like two opposing forces. Microsoft has embraced the open-source community quite cordially in recent years, and as a result we have things like Windows Subsystem for Linux baked right into our Windows installations. That doesn't mean that we no longer need",
          "link": "https://www.freecodecamp.org/news/how-to-dual-boot-any-linux-distribution-with-windows/",
          "publishedOn": "2021-12-23T16:32:46.000Z",
          "wordCount": 3744,
          "title": "How to Dual Boot Any Linux Distribution With Windows – and Get Rid of It When You Need To"
        },
        {
          "id": "61bd9cd6297c7107e8ad892a",
          "author": null,
          "description": "Binary trees are one of the most complicated data structures out there. And one of the reasons they're so difficult is that it's hard to actually visualize them in a simple way. In this tutorial, I'll show you how to create your own BinaryTreeViewer which will allow you to watch",
          "link": "https://www.freecodecamp.org/news/binarytreeviewer-with-c-c-css-html-by-gilad-bar-ilan/",
          "publishedOn": "2021-12-23T01:12:43.000Z",
          "wordCount": 2104,
          "title": "How to Create a BinaryTreeViewer using C#, CSS, &amp; HTML (Code &amp; Algorithm Walkthrough)"
        },
        {
          "id": "5fc5badb49c47664ed827efe",
          "author": null,
          "description": "An eternity ago in the year of 2012, a few Stanford professors decided to make their courses freely available online.  The media christened these courses \"MOOCs\" – Massive Open Online Courses. And they hailed 2012 as \"Year of the MOOC.\" Now, a decade later, the MOOC ecosystem has reached 220M learners",
          "link": "https://www.freecodecamp.org/news/most-popular-free-online-courses/",
          "publishedOn": "2021-12-22T22:44:00.000Z",
          "wordCount": 4695,
          "title": "The Top 100 Free University Courses of the Year (Ranked by Popularity)"
        },
        {
          "id": "61706bd9d48e1707b6d7923e",
          "author": null,
          "description": "If you work with WordPress, then you know just how important a good stack of plugins is. They were designed to improve everything from media handling, and basic features to security and more.  You can have as many as you like, in theory, but don't go overboard. A good rule",
          "link": "https://www.freecodecamp.org/news/best-wordpress-plugins/",
          "publishedOn": "2021-12-22T20:19:42.000Z",
          "wordCount": 2766,
          "title": "Best WordPress Plugins – 15 Tools to Boost Your Productivity"
        },
        {
          "id": "61bcf6e3297c7107e8ad8595",
          "author": null,
          "description": "Learn to Code RPG is an interactive visual novel game where you will teach yourself to code, make friends in the tech industry, and pursue your dream of becoming a developer.",
          "link": "https://www.freecodecamp.org/news/learn-to-code-rpg/",
          "publishedOn": "2021-12-22T17:23:00.000Z",
          "wordCount": 1958,
          "title": "Learn to Code RPG – A Visual Novel Video Game Where you Learn Computer Science Concepts"
        },
        {
          "id": "61bd5001297c7107e8ad85a9",
          "author": null,
          "description": "This is the press kit for the game, Learn to Code RPG.",
          "link": "https://www.freecodecamp.org/news/learn-to-code-rpg-press-kit/",
          "publishedOn": "2021-12-22T17:22:50.000Z",
          "wordCount": 394,
          "title": "Learn to Code RPG – Press Kit"
        },
        {
          "id": "61b5033707222107a6c78b01",
          "author": null,
          "description": "I recently attended a training session with the Auth0 Dev Rel team to learn about a cool new feature called Auth0 Actions.  In this article, I am going to explain what Auth0 Actions are, why you'd want to use them, and how to set one up. What are Auth0 Actions?",
          "link": "https://www.freecodecamp.org/news/intro-to-auth0-actions/",
          "publishedOn": "2021-12-22T15:46:00.000Z",
          "wordCount": 1425,
          "title": "How to Extend Your Login Flow With Auth0 Actions"
        },
        {
          "id": "61c1702f755c160824908877",
          "author": null,
          "description": "If you have an e-commerce application, a payment gateway lets you process payments on your website on the fly.  With all the modern payment gateway solutions available these days, there are many ways you can integrate payments and charge your users for your product or services.  In this tutorial, we",
          "link": "https://www.freecodecamp.org/news/integrate-a-payment-gateway-in-next-js-and-react-with-razorpay-and-tailwindcss/",
          "publishedOn": "2021-12-21T18:16:10.000Z",
          "wordCount": 3034,
          "title": "How to Set Up a Payment Gateway in Next.js and React with Razorpay and TailwindCSS"
        },
        {
          "id": "61c13344755c1608249086b5",
          "author": null,
          "description": "Since ECMAScript 6 (or ES6 for short), you can descructure objects in JavaScript. As a JavaScript developer, you’ll likely destructure objects as part of your daily work.  Let's learn about why we use destructuring, and then we'll learn how to destructure JavaScript objects. Why destructure an object?Let's go",
          "link": "https://www.freecodecamp.org/news/how-to-destructure-objects-javascript/",
          "publishedOn": "2021-12-21T16:47:41.000Z",
          "wordCount": 678,
          "title": "How to Destructure Objects in JavaScript"
        },
        {
          "id": "61bc5001297c7107e8ad7f94",
          "author": null,
          "description": "You've probably seen a \"back-to-top\" button at the bottom-right corner on many websites when you're scrolling around. Clicking on that button takes you back to the top of the page.  This is a great feature to have on any website, and today we are going to see how to build",
          "link": "https://www.freecodecamp.org/news/back-to-top-button-and-page-progressbar-with-html-css-and-js/",
          "publishedOn": "2021-12-21T16:39:02.000Z",
          "wordCount": 1882,
          "title": "How to Make a Back to Top Button and Page Progress Bar with HTML, CSS, and JavaScript"
        },
        {
          "id": "61bfadd5aabf6478ea7460fc",
          "author": null,
          "description": "When you work in IT operations, automation is a key part of your job.  You'll have various repetitive tasks you have to deal with, and you don’t want to waste your time doing something that can be done by a script.  Here are some great reasons to automate repetitive",
          "link": "https://www.freecodecamp.org/news/how-to-automate-tasks-with-azure-webjobs/",
          "publishedOn": "2021-12-21T16:33:48.000Z",
          "wordCount": 1158,
          "title": "How to Automate Tasks with Azure Webjobs"
        },
        {
          "id": "61c1ec91755c160824908a2e",
          "author": null,
          "description": "A Customer Relationship Management (CRM) is a system that helps businesses organize and manage their customer relationships. It is basically a big database for customer information. Since every business is a little different, it can be helpful to create your own CRM to meet your exact needs. We just published",
          "link": "https://www.freecodecamp.org/news/build-a-crm/",
          "publishedOn": "2021-12-21T15:11:44.000Z",
          "wordCount": 375,
          "title": "How to Build a Custom CRM"
        },
        {
          "id": "61b9e89107222107a6c7a4bc",
          "author": null,
          "description": "JavaScript is a programming language that's used for a variety of purposes, including web development, web apps, game development, and more. JavaScript also lets you add dynamic features to web sites that you can't just achieve with HTML and CSS. Importance of JavaScriptJavaScript is the most important language you need",
          "link": "https://www.freecodecamp.org/news/23-free-websites-to-learn-javascript/",
          "publishedOn": "2021-12-20T20:25:00.000Z",
          "wordCount": 1675,
          "title": "23 Free Websites to Learn JavaScript in 2022"
        },
        {
          "id": "61bf7907297c7107e8ad9091",
          "author": null,
          "description": "Transferring files between machines is a very common operational task that you'll do all the time as a developer.  Linux provides a number of utilities to transfer files. In this tutorial we will discuss FTP and SCP. Many automated scripts also deploy FTP or SCP to move files. What is",
          "link": "https://www.freecodecamp.org/news/how-to-transfer-files-between-servers-in-linux-using-scp-and-ftp/",
          "publishedOn": "2021-12-20T16:02:29.000Z",
          "wordCount": 1029,
          "title": "How to Transfer Files Between Servers in Linux using SCP and FTP"
        },
        {
          "id": "61ba394407222107a6c7a7f3",
          "author": null,
          "description": "The impact of networks and technology continues to increase. Understanding technology makes it easier to function in an information-centric world. We just published a massive course about Internet history and technology on the freeCodeCamp.org YouTube channel. In this course you will learn how the Internet was created, who created",
          "link": "https://www.freecodecamp.org/news/learn-the-history-of-the-internet-in-dr-chucks/",
          "publishedOn": "2021-12-20T14:10:44.000Z",
          "wordCount": 590,
          "title": "Learn the History of the Internet in Dr. Chuck&#x27;s 9-Hour Course"
        },
        {
          "id": "61b9cd2a07222107a6c7a467",
          "author": null,
          "description": "Have you ever read your horoscope in the newspaper or seen it on television? Well, I'm not sure about other countries, but in my country of India, people still read their horoscopes.  And this is where I got the idea for this tutorial. It might sound a bit old-fashioned, but",
          "link": "https://www.freecodecamp.org/news/python-project-build-an-api-with-beautiful-soup-and-flask/",
          "publishedOn": "2021-12-17T18:29:53.000Z",
          "wordCount": 2449,
          "title": "Python Project – How to Create a Horoscope API with Beautiful Soup and Flask"
        },
        {
          "id": "60c08960d3126007592d56fd",
          "author": null,
          "description": "HTML(Hyper Text Markup Language) is one of the languages we use to create web applications. It adds structure to your web pages. HTML has various tags we use to create elements. And multiple elements come together to create meaningful web pages and applications. The anchor tag is one of",
          "link": "https://www.freecodecamp.org/news/the-html-a-tag-anchor-tag-example-code/",
          "publishedOn": "2021-12-17T17:47:31.000Z",
          "wordCount": 2077,
          "title": "The HTML &lt;a&gt; Tag – Anchor Tag Example Code"
        },
        {
          "id": "61b8daa807222107a6c7a204",
          "author": null,
          "description": "As remote work becomes more and more popular, more and more people and companies are using video conferencing services such as Zoom.  Turning the built-in microphone on and off is one of the most useful features of Zoom.  In this quick guide you'll learn how to mute yourself with both",
          "link": "https://www.freecodecamp.org/news/how-to-mute-and-unmute-on-zoom-keyboard-shortcut/",
          "publishedOn": "2021-12-16T18:50:11.000Z",
          "wordCount": 552,
          "title": "How to Mute on Zoom – Mute Yourself with a Keyboard Shortcut or a Press of a Button"
        },
        {
          "id": "61bb54db07222107a6c7acd9",
          "author": null,
          "description": "Asking for help on a forum is a great way to learn and grow as a developer. But it is important that you know how to ask good questions so people can effectively help you.  In this article, I will walk you through how to ask good questions on a",
          "link": "https://www.freecodecamp.org/news/how-to-ask-a-question-on-a-forum/",
          "publishedOn": "2021-12-16T17:39:57.000Z",
          "wordCount": 700,
          "title": "How to Ask a Question on a Forum"
        },
        {
          "id": "61bb4ce307222107a6c7ac86",
          "author": null,
          "description": "I've been using Windows Subsystem for Linux (WSL) for my OS class for quite a while now. And I love how I can use Linux commands in Windows in a straightforward way without the added complexity of installing a virtual machine or dual booting.  By the end of this article,",
          "link": "https://www.freecodecamp.org/news/how-to-run-linux-apps-on-windows-10-11-using-wsl/",
          "publishedOn": "2021-12-16T17:33:23.000Z",
          "wordCount": 844,
          "title": "How to Run Linux Apps on Windows 10 and 11 Using WSL"
        },
        {
          "id": "61bb192507222107a6c7aa8e",
          "author": null,
          "description": "Windows 10 has an incredible Graphics User Interface (GUI) that will often be enough for you to get things done.  But if your inner Oliver Twist wants more, then you should start learning about the Command Line.  With the command prompt, you get access to features that are not available",
          "link": "https://www.freecodecamp.org/news/windows-10-command-line-tricks/",
          "publishedOn": "2021-12-16T16:37:46.000Z",
          "wordCount": 1596,
          "title": "14 Windows 10 Command Line Tricks that Give You More Control Over Your PC"
        },
        {
          "id": "61ae2a2e946db661defb7dda",
          "author": null,
          "description": "As a frontend developer, it's your job to make sure that the user interface of a software program functions properly.  It's a difficult job because you have to make sure that every component works the way it's supposed to so that users have a good experience. Frontend development is in",
          "link": "https://www.freecodecamp.org/news/top-skills-for-new-frontend-developers/",
          "publishedOn": "2021-12-15T16:56:37.000Z",
          "wordCount": 1551,
          "title": "Top Skills All New Frontend Developers Should Have"
        },
        {
          "id": "61b6846607222107a6c78d81",
          "author": null,
          "description": "JavaScript modules (also known as ES modules or ECMAScript modules) were created to help make JavaScript code more organized and maintainable. Understanding how ES modules work will help you become a better JavaScript developer. In this article, we'll cover: What is a module?What are ES modules? Why do we",
          "link": "https://www.freecodecamp.org/news/javascript-modules-beginners-guide/",
          "publishedOn": "2021-12-15T16:47:38.000Z",
          "wordCount": 1838,
          "title": "JavaScript Modules – A Beginner&#x27;s Guide"
        },
        {
          "id": "61ba06ac07222107a6c7a6f4",
          "author": null,
          "description": "A linked list is a common data structure used in software development. It is also a frequent topic in technical coding interviews. We just published a course on the freeCodeCamp.org YouTube channel that will teach you all about linked lists and prepare you to use them in coding interviews",
          "link": "https://www.freecodecamp.org/news/linked-lists-in-technical-interviews/",
          "publishedOn": "2021-12-15T15:22:28.000Z",
          "wordCount": 366,
          "title": "Linked Lists in Technical Interviews"
        },
        {
          "id": "61b6941b07222107a6c78e39",
          "author": null,
          "description": "In this tutorial, we'll talk about what React Router is and how to use it. Then we'll discuss its features and how to use them in your React app to navigate to and render multiple components.  PrerequisitesA React appA good understanding of what components are in React. Node.js installed.",
          "link": "https://www.freecodecamp.org/news/how-to-use-react-router-version-6/",
          "publishedOn": "2021-12-14T21:41:14.000Z",
          "wordCount": 1335,
          "title": "React Router Version 6 Tutorial – How to Set Up Router and Route to Other Components"
        },
        {
          "id": "61b8699d07222107a6c79cf7",
          "author": null,
          "description": "GitHub has many special repositories, like the README in your profile. You can get creative and add all sorts of helpful information there. Another special repository is the .github repository. This might remind you of the .github directory in repositories which house workflows, issue templates, pull request templates, funding information,",
          "link": "https://www.freecodecamp.org/news/how-to-use-the-dot-github-repository/",
          "publishedOn": "2021-12-14T18:01:15.000Z",
          "wordCount": 2087,
          "title": "How to Use the .github Repository"
        },
        {
          "id": "61b72c5d07222107a6c79095",
          "author": null,
          "description": "In this tutorial, we will learn how to create a server. We will begin without express and then strengthen the server using express. After that, we will see how to upload images to Cloudinary from the app we have created. I assume that you already understand the basics of Node.",
          "link": "https://www.freecodecamp.org/news/build-a-secure-server-with-node-and-express/",
          "publishedOn": "2021-12-14T16:51:14.000Z",
          "wordCount": 2837,
          "title": "How to Build a Secure Server with Node.js and Express and Upload Images with Cloudinary"
        },
        {
          "id": "6172cfe3d48e1707b6d79bc9",
          "author": null,
          "description": "Every day major companies have vulnerabilities exploited in their software. It is important to learn how to protect your applications against data breaches.  In this article you all about DevSecOps and web security. There is a video course that goes along with this article. The article focuses on the definitions",
          "link": "https://www.freecodecamp.org/news/what-is-devsecops/",
          "publishedOn": "2021-12-14T14:08:56.000Z",
          "wordCount": 2454,
          "title": "Securing Your Apps - What is DevSecOps?"
        },
        {
          "id": "61b5815307222107a6c78cf7",
          "author": null,
          "description": "Designing a distributed system that supports millions of users is a complex task, and one that requires continuous improvement and refinement.  Recently I read a book by Alex Xu called \"System Design Interview – An Insider's Guide\". This article, inspired by the first part of the book, shares some popular techniques",
          "link": "https://www.freecodecamp.org/news/how-to-scale-a-distributed-system/",
          "publishedOn": "2021-12-13T23:37:24.000Z",
          "wordCount": 1964,
          "title": "How to Scale a Distributed System"
        },
        {
          "id": "61b3865f07222107a6c7822e",
          "author": null,
          "description": "An API, or Application Programming Interface, is a server that lets you retrieve and send data using code. We mostly commonly use APIs to retrieve data, and that will be the focus of this beginner-friendly tutorial. When we want to receive data from an API, we need to make a",
          "link": "https://www.freecodecamp.org/news/how-to-interact-with-web-services-using-python/",
          "publishedOn": "2021-12-13T23:03:42.000Z",
          "wordCount": 3247,
          "title": "Python Requests – How to Interact with Web Services using Python"
        },
        {
          "id": "61aca6a8946db661defb7a86",
          "author": null,
          "description": "In this blog post I'll walk you through a real life example which uses the concept of classes in Javascript.  I think it's helpful to work with a practical use case because it is much simpler to understand the concepts when you can relate them to real life.  So in",
          "link": "https://www.freecodecamp.org/news/javascript-classes-how-they-work-with-use-case/",
          "publishedOn": "2021-12-13T19:24:50.000Z",
          "wordCount": 3609,
          "title": "JavaScript Classes – How They Work with Use Case Example"
        },
        {
          "id": "61783e5e33422e07df364ce7",
          "author": null,
          "description": "People often ask me: Should I present myself as a solo freelancer or as an agency?In this article I will explore this idea with you and hopefully leave you with a clearer sense of direction. TL;DR: You can do both. The Benefits of Solo vs Agency FreelancingWhether you",
          "link": "https://www.freecodecamp.org/news/solo-freelancing-vs-agency/",
          "publishedOn": "2021-12-13T17:18:18.000Z",
          "wordCount": 1291,
          "title": "Solo Freelancing vs Agency – What&#x27;s The Difference?"
        },
        {
          "id": "61b760fc07222107a6c79303",
          "author": null,
          "description": "Screencasting is a cool feature that was built into the Windows 10 Anniversary update in 2019.  It's also called Wireless Display. It lets you project your phone display to a Windows 10 computer – which can help you out in a lot of ways, especially if you’re a YouTuber.  Getting",
          "link": "https://www.freecodecamp.org/news/share-screen-on-android-how-to-cast-my-screen-with-a-windows-10-pc/",
          "publishedOn": "2021-12-13T17:09:33.000Z",
          "wordCount": 775,
          "title": "Share Screen on Android – How to Cast my Screen with a Windows 10 PC"
        },
        {
          "id": "61b20893946db661defb946a",
          "author": null,
          "description": "Python is a great programming language to learn and you can use it in a variety of areas in software development.  You can use Python for web development, data analysis, machine learning, artificial intelligence, and more. In this article, I will list out 15 free Python courses for beginners.  Learn",
          "link": "https://www.freecodecamp.org/news/learn-python-free-python-courses-for-beginners/",
          "publishedOn": "2021-12-13T16:57:33.000Z",
          "wordCount": 1005,
          "title": "Learn Python – Free Python Courses for Beginners"
        },
        {
          "id": "61b76db107222107a6c79384",
          "author": null,
          "description": "Full stack web development includes the backend that happens on a server and the frontend that happens on a web browser. New tools are making it easier than ever to create a full stack web app. We just published a full stack web development course on the freeCodeCamp.org YouTube",
          "link": "https://www.freecodecamp.org/news/become-a-full-stack-developer-with-svelte/",
          "publishedOn": "2021-12-13T16:23:09.000Z",
          "wordCount": 409,
          "title": "Become a Full Stack Developer with Svelte, Postgres, Vercel, and Gitpod"
        }
      ]
    }
  ],
  "cliVersion": "1.12.0"
}